#include <stdio.h>                     // Header file การรับข้อมูลเข้า(input) และแสดงผลออก(Output)

int main() {                           // จุดเริ่มต้นของโปรแกรม โดยฟังก์ชั่นนี้จะคืนค่า Return เป็นจำนวนเต็ม

    char name[3];                      // ประกาศตัวแปร name(array) โดยเก็บข้อความได้มากสุด 3 ตัว
    int age[3];                        // ประกาศตัวแปร age(array) โดยเก็บข้อความได้มากสุด 3 ตัว
    float height[3], weight[3];        // สร้างตัวแปร height และ weight โดยเป็นเลขทศนิยม และในแต่ละตัวแปรสามารถข้อมูลได้ 3 ชุด
    char grade[3];                     // ประกาศตัวแปร grade(array) โดยเก็บข้อความได้มากสุด 3 ตัว

    for (int x = 0; x < 3; x++) {      // ใช้ For Loop รับค่าข้อมูล i โดยหาก i มากกว่าหรือเท่ากับ 3 ให้สิ้นสุดการ loop 
        
        printf("Enter name, age, height(cm), weight(kg), grade for person %d: ", x + 1);  // แสดงข้อวามเพื่อกรอก name age height weight grade for person
        scanf(" %c %d %f %f %c", &name[x], &age[x], &height[x], &weight[x], &grade[x]);   // โดยให้ใส่ อักษรตัวแรกname, ageเป็นจำนวนเต็ม, heightเป็นทศนิยม 1 ตำแหน่ง, weightป็นทศนิยม 2 ตำแหน่ง,gradeเป็นตัวอักษร 1 ตัว

    }

    printf("+--------+-----+------------+------------+------------+\n");    //
    printf("| Name   | Age | Height(cm) | Weight(kg) | Grade Code |\n");    // สร้างหัวตารางสำหรับสรุปผลข้อมูล
    printf("+--------+-----+------------+------------+------------+\n");    //

    for (int x = 0; x < 3; x++) {           // ใช้ For Loop โดยกำหนกให้ x = 0และหาก x มากกว่าหรือเท่ากับ 3 ให้สิ้นสุดการ loop 
        
        printf("| %-6c | %3d | %10.1f | %10.1f | %10c |\n",         
            name[x], age[x], height[x], weight[x], grade[x]);       
        // สร้างตารางชื่อให้มีขนาด 6 ช่องแสดงผลเป็นตัวอักษรและชิดไปทางซ้าย, สร้างตารางอายุให้มีขนาด 3 ช่องโดยแสดงผลเป็นตัวเลขและให้ชิดขวา, สร้างตารางส่วนสูงขนาด 10 ช่องโดยแสดงผลเป็นทศนิยม 1 ตำแหน่งและให้ชิดขวา
        // สร้างตารางน้ำหนักขนาด 10 ช่องโดยแสดงผลเป็นทศนิยม 1 ตำแหน่งและให้ชิดขวาม, สร้างตารางเกรดให้มีขนาด 10 ช่องแสดงผลเป็นตัวอักษรและชิดไปทางขวา
        // โดยในตารางแสดงผลจะแสดงผลชุดข้อมมูลที x = 0 ขึ้นมาและเมื่อแดงผลเสร็จจะ แสดงชุดข้อมมูลที่ x = 1 ออกมาและเมื่อแสดงผลเสร็จจะแสดงชุดข้อมูที่ x = 2 ออกมา และจะทำการปิดท้ายตารางสรุปผล

    }

    printf("+--------+-----+------------+------------+------------+\n");    // สร้างส่วนท้ายของตาราง

    return 0;                                                               // คืนค่า 0 เสร็จสิ้นกระบวนการ
}